{
  "hazard_base_cases": [
    "A large object obstructs the roadway, forcing vehicles to stop or maneuver around it.",
    "A driver suddenly veers into another lane without signaling, creating a collision risk.",
    "Debris from an accident is scattered across multiple lanes, posing a hazard to vehicles.",
    "A fallen tree blocks the entire width of the road, making passage impossible.",
    "Potholes or road damage cause instability, increasing the likelihood of loss of control.",
    "Floodwaters partially submerge the road, leading to stalled vehicles and unsafe driving conditions.",
    "Unexpected road barriers or cones disrupt normal traffic flow in an ongoing construction zone.",
    "Pedestrians or cyclists abruptly enter the driving lane, requiring immediate braking.",
    "Sudden braking by a vehicle ahead results in a chain reaction of abrupt stops.",
    "Icy patches or snow accumulation reduce traction and visibility, making driving dangerous.",
    "A car slams on the brakes at an intersection due to an unseen obstacle ahead.",
    "Erratic lane-switching and unpredictable behavior from surrounding drivers in heavy traffic.",
    "A wild animal darts onto the roadway, forcing drivers to react instantly.",
    "A distracted pedestrian unexpectedly steps onto the road, causing vehicles to swerve or stop.",
    "A critical lane closure appears suddenly due to emergency maintenance work.",
    "Heavy rain or dense fog significantly reduces visibility, leading to sudden braking incidents.",
    "A malfunctioning traffic signal creates confusion at a busy intersection, increasing collision risks.",
    "A roadside accident results in scattered debris and partial lane blockages.",
    "Cargo or objects fall off a truck, creating immediate obstacles for following vehicles.",
    "A disabled vehicle in the middle of a busy road obstructs normal traffic flow."
  ],
  "no_hazard_base_cases": [
    "All vehicles are maintaining their lanes with no sudden movements or lane changes.",
    "Drivers adhere to traffic signals and maintain safe following distances.",
    "Pedestrians cross at designated crosswalks while obeying traffic signals.",
    "The road is free of debris, potholes, or obstructions under clear weather conditions.",
    "Vehicles follow well-marked lanes with smooth and consistent movement.",
    "Traffic flows in an orderly manner on highways without unexpected disruptions.",
    "Drivers exhibit smooth acceleration and deceleration, ensuring safe travel.",
    "A construction zone is properly marked with clear detours and warning signs.",
    "No unexpected obstacles or sudden lane closures are present on the road.",
    "Intersections operate smoothly with fully functioning traffic lights.",
    "Roads are well-lit at night, with clear visibility and properly marked lanes.",
    "Drivers show predictable behavior, maintaining a steady speed and direction.",
    "Highway exits and entry points are being used as intended without sudden merges.",
    "No adverse weather conditions affect visibility or road traction.",
    "Traffic is moving at a consistent speed without sudden halts or disruptions.",
    "Public transportation and private vehicles follow designated routes without causing blockages.",
    "Roundabouts and merges are navigated smoothly without congestion or confusion.",
    "Pedestrian areas remain separate from vehicular lanes, reducing risk.",
    "All vehicles are operating without mechanical failures that might cause a hazard.",
    "No distractions or unpredictable elements are affecting driver behavior on the road."
  ]
}
